SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( OR-80002T-A

Comment( British Rail STD 4MT 80002 2-6-4 Tank Engine )

Comment  ( *****  Minimum OR Parameters - Wagon Section ****** )
	
Comment ( General Information Included in this section - Type, Shape, Size, Mass, etc )

	Type ( Engine )
	WagonShape ( DR_BR_4MT_80002.s )
	
	Size  ( 2.79516m 3.96468m 13.707292m )
	Mass ( 86.65t-uk )

Comment( ********* Coupler Information ****************             Included in this section - Type, Spring, Velocity, etc )

	Coupling (
         Type ( Chain )
              	Spring (
			Break ( 600kN 1000kN )
               	r0 ( 0cm 0cm )
              )
          CouplingHasRigidConnection (1)
     )  

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 237kN ) Comment(55% WWO Weight*Cof 0.5)
MaxHandbrakeForce ( 87kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21 ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 2.7m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 15.0ft )
Comment(WheelBase = 1.25 x (axles-1) x Drive Diameter)

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(Cn 1990 DWx18)
ORTSDavis_A ( 5885 )
ORTSDavis_B ( 28.97 )
ORTSDavis_C ( 5.235 )

ORTSWagonFrontalArea (98)
ORTSDavisDragConstant (0.0024)

Comments(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

Lights	( 12
		Light	(
			comment( Flickering firebox )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( -0 2.0 -2.5 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -0 2.2 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
									
								)
						)
			)
		Light	(
			comment( Cab glow )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				TimeOfDay ( 0 )

			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff7200 )
					Position ( 0 2.2 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.2 )
					)
				)
			)
		Light	(
			comment( flickering fire underneath LHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 0 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 1 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position ( -0.5 0.9 -1.8 )
						Azimuth ( -45 -90 -135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( flickering fire underneath RHS )
				Type		( 0 )
				Conditions	(
				Headlight ( 0 )
				TimeOfDay ( 0 )
				Unit ( 0 )
			)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle ( 0 )
				States	(	4
					State	(
						Duration ( 0.02 )
						LightColour ( aaffa200 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffae00 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 3 )
						)
					State	(
						Duration ( 0.03 )
						LightColour ( aaffa900 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 2 )									)
					State	(
						Duration ( 0.01 )
						LightColour ( aaffa000 )
						Position ( 0.5 0.9 -1.8 )
						Azimuth ( 45 90 135 )
						Transition ( 0 )
						Radius ( 4 )									)
				)
			)
		Light	(
			comment( Front White Position B )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				Service ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( aaffffee )
						Position ( 1.0 1.48 6.46 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Front White Position D )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				Service ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( aaffffee )
						Position ( -1.0 1.48 6.46 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Front Red Reversed Position B )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				Service ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( 80ff0000 )
						Position ( 1.0 1.48 6.46 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Front Red Reversed Position D )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				Service ( 2 )
				)
				FadeIn	( 0.5 )
				FadeOut	( 0.5 )
				Cycle		( 0 )
				States	(	1
					State	(
						Duration ( 0.0 )
						LightColour ( 80ff0000 )
						Position ( -1.0 1.48 6.46 )
						Azimuth ( 0.0 -5.0 5.0 )
						Transition ( 0 )
						Radius ( 0.55 )
					)
				)
			)
		Light	(
			comment( Rear Red Position B )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				Service ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( -1.0 1.51 -6.50 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		Light	(
			comment( Rear Red Position D )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				Service ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( 80ff0000 )
					Position ( 1.0 1.51 -6.50 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		Light	(
			comment( Rear White Reversed Position B )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				Service ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aaffffee )
					Position ( -1.0 1.51 -6.50 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		Light	(
			comment( Rear White Reversed Position D )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				Service ( 2 )
			)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle		( 0 )
			States	(	1
				State	(
					Duration ( 0.0 )
					LightColour ( aaffffee )
					Position ( 1.0 1.51 -6.50 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.55 )
				)
			)
		)
		)


Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

FreightAnim ( "..\\common.crew\\LIB_2\\Std4Tank.s" 0 3.0 0.0 )

Comment ( ==Passenger View== )
	Inside (
        PassengerCabinFile ( DR_BR_4MT_80002.s )
        PassengerCabinHeadPos ( 1.455 3.2 -2.676 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

	IntakePoint ( 0.9 10 FuelWater )
	IntakePoint ( -0.9 8 FuelCoal )
    
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardeng.sms" )
)



Engine ( OR-80002T-A
    
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.0 3.831 -1.592
				0 -0.1 1.05
				0.3
			)

			SafetyValvesFX
			(
				0 3.871 -0.855
				0 0.95 0
				0.2
			)
			SafetyValvesFX
			(
				0 3.871 -1.164
				0 -0.8 0
				0.35
			)
			StackFX
			(
				0 4.070 4.538
				0 0.95 0
				0.3
			)
			StackFX
			(
				0 4.070 4.538
				0 0.95 0
				0.25
			)
			StackFX
			(
				0 4.070 4.538
				0 0.95 0
				0.25
			)
			DrainpipeFX
			(
				-1.5 1.258 -3.886
				-0.4 -1 -0.2
				0.05
			)

			Injectors2FX
			(
				1.22 0.6 -2.75
				0 -1 -1
				0.15
			)
			Injectors1FX
			(
				1.22 0.6 -2.95
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-0.965 0.845 5.374
				0 0.1 1
				0.20
			)

			CylindersFX
			(
				0.965 0.845 5.374
				0 0.1 1
				0.20
			)
		)
	)

Wagon ( OR-80002T-A )
Comment ( *************General Information******************                    Included in this section - Wheels, sanding, etc )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 34in )
NumWheels ( 3 )
ORTSDriveWheelWeight ( 53.05t-uk  )  
Sanding ( 25mph )

Comment ( ****************** Boiler ************************          Included in this section - Length, volume, heating area, pressure, etc )

ORTSSteamBoilerType ( Superheated )
BoilerVolume ( 180ft^3 ) 
ORTSEvaporationArea ( 1366ft^2 )
ORTSSuperheatArea ( 240ft^2 )
MaxBoilerPressure ( 225psi )
MaxSteamHeatingPressure ( 70psi )

Comment ( ***************** Cylinders **********************         Included in this section - Number, Stroke, Diameter, steam usage, etc )

NumCylinders ( 2 )
CylinderStroke ( 28in ) 
CylinderDiameter ( 18in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  Comment ( Default Setting)

Comment ( ******************* Fire *************************          Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc ) 

ORTSFuelCalorific ( 12390btu/lb ) Comment(Blidworth Coal)
ORTSGrateArea ( 26.7ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )    

Comment ( ******************* Fuel *************************
Included in this section - Coal, water, Tender Presence, etc )

MaxTenderCoalMass ( 3.5t-uk )
MaxTenderWaterMass ( 20000lb )
IsTenderRequired( 0 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

ORTSBoilerEvaporationRate ( 15.0) 

Comment(ORTSMaxIndicatedHorsepower ( 1120.0hp ))

ORTSMaxSuperheatTemperature ( 280.0 )

Comment (ORTSSuperheatCutoffPressureFactor ( 45.0 ))

ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 )Comment(From Report)

ORTSBurnRate( 0.0 10.0   6000.0 690.0   8000.0 965.0   10000.0 1260.0   12000.0 1580.0   14000.0 1935.0   16000.0 2335.0  18000.0 2790.0  19600.0 3250.0  22490.0 5078.0 ) Comment (From 4MT Report)

ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 )

Comment(ORTSCylinderBackPressure ( 0.0 0.0  2500 18.0 ))


Comment ( ***********Gearing (If used) *************************
Included in this section - Gear type, ratio, etc )

Comment ( *****************Brake System ********************        Included in this section - Compressor, Reservoir, Application rates, etc )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21 )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control System (if used)**********        
Includes Monitoring of Overspeed, Vigilance, Emergency Braking)

Comment ( ************** Engine Controls ******************** 
Included-Controllers for Regulator, Reverser, Brakes etc) 

EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.5
NumNotches( 3
Notch ( 0.0 0 TrainBrakesControllerReleaseStart )
Notch ( 0.1 0 TrainBrakesControllerRunningStart )
Notch ( 0.2 1 TrainBrakesControllerVacuumContinuousServiceStart ) ) )


            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
            ORTSSteamHeat( 0 1 0.0125 0.5 )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Comment ( ********** Miscellaneous Information *************              Included in this section - Alternate Views, Sounds, Names, Description etc )  

	Cabview ( Standard4Tank.cvf )
	HeadOut (  -1.455 3.2 -2.676 )
 
Sound ( "..\\..\\Common.MEP\\Standard2MT-4MTSound\\Standardcab.sms" )
    	Name ( "80002-Standard 4MT Tank, Class A, Coal 3.5t, Water 2000gal, Reverse\n"+ " Cab" )
 	Description (
 	"On the decision to build the BR standard series of locomotives, a series of class four tank engines was ordered, based on the ex LMS Fairburn 2-6-4T with some modifications. The lineage of the class could therefore be tracked through the LMS/BR 2-6-4T locomotives back to the Fowler design of 1927. Design work was done at Brighton, the overall programme being overseen by R A Riddles. The principal modifications to the Fairburn design involved the reduction of their envelope to enable them to fit into the L1 loading gauge. To do this the tanks and cab were made more curved than the Fairburn design, the Fairburn having a straight-sided tank. The biggest mechanical change was a reduction in cylinder size, also to reduce cross-section, and a corresponding increase in boiler pressure to compensate. Other visible changes include the reintroduction of plating ahead of the cylinders."
)
)
